Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа.
<p>Решение: Для решение задачи потребуется задать массив на определённое количество элементов, которое мы зададим сами.
Начинаем с создания функции проверки правильности ввода. Создаём функцию и присваиваем ей имя:
<p><code>byte GetNumberFromConsole()</code>
<p>Функция вернёт нам значение byte, диапазона предоставляемых чисел не только будет достаточно для определения длины нашего массива, но так же будет резервировать меньше памяти под переменную. Далее мы инициализируем переменную того же типа byte для хранения нашего числа:
<p><code>byte n = 0;</code>
<p>Следующим шагом создаём цикл while который при неправильном вводе будет запрашивать пользователя ввести информацию повторно.
Условием для выхода из цикла является ввод числового значения больше 0, но меньше 256 (так как тип переменной byte предоставляет диапазон значений от 0 до 255).
<p><code>while (!byte.TryParse(Console.ReadLine(), out n) || n <= 0)</code>
<p>Получив нужное нам число мы возвращаем его через команду return:
<p><code>return n;</code>
<p>Чтобы значение вернулось необходимо для начала инициализировать переменную в методе main:
<p><code>byte n = GetNumberFromConsole();</code>
<p>Получив размер нашего массива, время его инициализировать:
<p><code>string[] array = new string[n];</code>
<p>Исходя из условий задачи мы создаём строковый массив, в котором могут содержаться как числа, так и буквы с символами.
<p>Инициализируем счётчик count типа byte в который будем записывать количество элементов длиной меньше, либо равно 3. Он потребуется нам для создания отсортированного массива:
<p><code>byte count = 0;</code>
<p>С помощью цикла for заполняем наш массив вручную через консоль, параллельно следим за количеством элементов длиной меньше 3, увеличивая счётчик count на 1. Он нам потребуется для определения размера отсортированного массива:
<p><code>for (byte i = 0; i < array.Length; i++)
<p>{
<p>Console.Write($"Задайте значения для {i + 1} элемента: ");
<p>array[i] = Console.ReadLine();
<p>if (array[i].Length < 4) count++;<p>}</code>
<p>Задаём второй массив отсортированных данных, который мы будем выводить в консоль:
<p><code>string[] sortedArray = new string[count];</code>
<p>Счётчик count исполнил свою задачу, однако он ещё пригодится в дальнейшем, чтобы не заводить новую переменную и резервировать лишнее место в памяти. Обнулим этот счётчик:
<p><code>count = 0;</code>
<p>Осталось заполнить новый массив искомыми элементами и вывести его через консоль. Вновь используем цикл for для нашей задачи. В каждой итерации мы заново проходимся по оригинальному массиву в поиске нужных элементов, только в этот раз найденный элемент записывается в отсортированный массив. Начиная с индекса равному count при каждой записи значения счётчик увеличивается на 1:
<p><code>for (byte j = 0; j < array.Length; j++)
<p>{
<p>if (array[j].Length < 4) sortedArray[count++] = array[j];
<p>}</code>
<p><code>Console.WriteLine("Отсортированный массив: " + "[\"" + string.Join("\", \"", sortedArray) + "\"]");</code>
<p>Отсортированный массив заполнен значениями и выеден через консоль. Задача выполнена.